bombardier_test.txt
Bombarding http://localhost:8080/api/sendCoin with 10000 request(s) using 100 connection(s)
 10000 / 10000 [========================================================================================================================================] 100.00% 579/s 17s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       584.97      94.06     844.52
  Latency      171.00ms    29.77ms   400.70ms
  HTTP codes:
    1xx - 0, 2xx - 10000, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:   254.16KB/s